Revit 2027 API
SelectionFilterElement.Clear Method
 Removes all ElementIds from the filter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Clear()
Public Sub Clear
public:
void Clear()
member Clear : unit -> unit
See Also
Reference
SelectionFilterElement Class
Autodesk.Revit.DB Namespace